module.exports = {
  prefix: "-", // البريفكس (البادئة)
  color: "#ffaf00", //لون الإيمبد
  ratebRoles: [
    {
      id: "1121946030125092916",
      salary: 65000,
    },
    {
      id: "1121941265425104978",
      salary: 55000,
    },
    {
      id: "1121946019362525306",
      salary: 50000,
    },
    {
      id: "1121947240517345291",
      salary: 45000,
    },
    {
      id: "1121947258787725332",
      salary: 40000,
    },
    {
      id: "1121947238369853481",
      salary: 35000,
    },
    {
      id: "1121947245416296458",
      salary: 30000,
    },
    {
      id: "1121947260381560924",
      salary: 25000,
    },
    {
      id: "1121946014627151882",
      salary: 20000,
    },
{
      id: "1121948241399910461",
      salary: 18000,
    },
      {
      id: "1121948244646318224",
      salary: 16000,
    },
      {
      id: "1121948279832330291",
      salary: 14000,
    },
      {
      id: "1121948271506628668",
      salary: 12000,
    },
      {
      id: "1121949186175291392",
      salary: 11000,
    },
      {
      id: "1121949180231954535",
      salary: 9500,
    },
      {
      id: "1121949218693730304",
      salary: 7000,
    },
{
      id: "1121949175509155910",
      salary: 5500,
    },
      {
      id: "1122101351275573258",
      salary: 45000,
    },

  ],// الرتب مع الرواتب الي تنزل
  adminRole: "1121910616689475696",//رتبة الادمن الي يستخدم الاوامر المحددة
  imageBank:
    "https://cdn.discordapp.com/attachments/1134958666219532420/1136793461421523015/20230804_012527.png", // تغيير الصورة في الايمبد
  violations: [
    {
      title: "تفحيط",
      price: 5000,
    },
    {
      title: "قيادة المركبه بسرعه جنوانيه",
      price: 500,
    }, 
        {
      title: "قطع الاشارة الضوئية",
      price: 3000,
    }, 
        {
      title: "الاصطدام بمركبة حكومية",
      price: 5000,
    }, 
        {
      title: "وقوف خاطئ",
      price: 350,
    }, 
        {
      title: "ازعاج سلطات",
      price: 10000,
    }, 
        {
      title: "الهروب من رجال الامن",
      price: 7000,
    }, 
        {
      title: "عكس سير",
      price: 350,
    }, 
        {
      title: "الاستهزاء برجال الامن",
      price: 20000,
    }, 
        {
      title: "وقوف المركبة او تحركها فوق الرصيف",
      price: 1000,
    }, 
        {
      title: "تخريب ممتلكات الدوله",
      price: 50000,
    }, 
        {
      title: "سوء استخدام منبه المركبه البوري",
      price: 500,
    }, 
        {
      title: "رشوة موضف حكومي",
      price: 5000,
    }, 

  ], // المخالفات
  sadadLogo:
    "https://cdn.discordapp.com/attachments/1121891284622258216/1136795097476903064/20230804_013129.png", //شعار سداد
      sadadLaga:
    "https://cdn.discordapp.com/attachments/1134958666219532420/1137425392836300860/20230805_194219.png", //شعار سداد

  rolePaused: "1122107315483590736", // رتبة ايقاف الخدمات للشخص
  roles: {
  ايقاف_الخدمات: "1134602688651329536",
    امر_ارسال: "1134602688651329536",
    المخالفات_والسجل: "1134602688651329536",
    تحكم_الاموال: "1134602688651329536",
    امر_فحص: "1134602688651329536",
  توزيع_الرواتب: "1122101354714910730",
    اوامر_التصفير: "1121910616689475696",
    امر_تفعيل: "1134602688651329536",
    امر_رواتب: "1121910616689475696",
  }
};


